In [46]:
import numpy as np
import pandas as pd

In [47]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [48]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df=pd.DataFrame(data_list)
column = ["Name","Age","City","Salary"]
df2=pd.DataFrame(data_list,columns=column)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [49]:
#selection and indexing
df2[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [50]:
#create a column
df2["Designation"]=["Developer","Manager","Designer","Developer"]
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000   Developer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000    Designer
3  Linda   42    London   85000   Developer

In [51]:
#Removing a column
df2.drop("Designation",axis = 1,inplace=True ) #inplace for permanent deletion of data 
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [53]:
#Selecting Rows
df2.loc[[0,1]] #loc is location for selecting rows

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [54]:
df2.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [55]:
#Selecting Subsets of Rows and columns 
df2.loc[[0,1]] [["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [56]:
df2.loc[[2,3]] [["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

In [57]:
#conditional selection
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [66]:
#Age above 30
df2[df2["Age"]>30]

    Name  Age   City  Salary
1   Anna   34  Paris   70000
3  Linda   42  Paris   85000

In [71]:
df2[(df2["Age"] > 30) & (df2["City"] == "Paris")]

    Name  Age   City  Salary
1   Anna   34  Paris   70000
3  Linda   42  Paris   85000